def game0():
    苹果数初始 = int(input(">>请输入苹果数:"))
    香蕉数初始= int(input(">>请输入香蕉数:"))
    print("苹果",苹果数初始,"香蕉",香蕉数初始)
    print(f"现在我手里有 {苹果数初始} 个苹果，有 {香蕉数初始} 个香蕉")
    return 苹果数初始,香蕉数初始
def game1():
    被吃掉的苹果 = int(input(">>你想吃掉多少苹果:"))
    被吃掉的香蕉 = int(input(">>你想吃掉多少香蕉:"))
    print("被吃掉的苹果_",被吃掉的苹果,"被吃掉的香蕉",被吃掉的香蕉)
    print(f"我吃掉了 {被吃掉的苹果}个苹果，吃掉了 {被吃掉的香蕉}个香蕉")
    return 被吃掉的苹果,被吃掉的香蕉
def game2(苹果数初始,被吃掉的苹果,香蕉数初始,被吃掉的香蕉):
    print("正在计算")
    剩余苹果数 = 苹果数初始-被吃掉的苹果
    剩余香蕉数 = 香蕉数初始-被吃掉的香蕉
    print(f"剩余苹果有 {剩余苹果数}，剩余香蕉有 {剩余香蕉数}")
    if 剩余苹果数 <0 and 剩余香蕉数 < 0:
        print("小馋猫")
    elif 剩余苹果数 <5 and 剩余香蕉数 < 5:
        print("再多吃点？")
    elif 剩余苹果数 <10 and 剩余香蕉数 <10:
        print("看起来你不喜欢水果")
def main():
    初始苹果,初始香蕉= game0()
    吃掉苹果,吃掉香蕉 = game1()
    game2(初始苹果,初始香蕉,吃掉苹果,吃掉香蕉)
main()